Enums/СтатусыАктаОРасхождениях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыАктаОРасхождениях</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отрабатывается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтработаноВУТ11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКонтроле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласовано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПТУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Составлен</Name>
					<Comment>Документ создан. В проведенном состоянии документ ожидает проведения Переоценки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПоступлению</Name>
					<Comment>Создан и проведен документ Перемещение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
					<Comment>Начата приемка товара в филиале</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОбработка</Name>
					<Comment>Ожидается обработка расхождений, выявленных при приемке товара</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
					<Comment>Ожидается проверка документов Бухгалтерией</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ценообразование</Name>
					<Comment>Ожидается Переоценка по расхождениям, выявленным в результате приемки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороректировкаОстаткаВУТ10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
					<Comment>Работа с документом завершена</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>(Регл) Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

WebServices/UpdateVarianceAct/Ext/Module.bsl
Функция СоздатьСерию(Номенклатура, НомерГТД, Страна, НомерГТДСсылка)
	
	Серия = Справочники.СерииНоменклатуры.НайтиПоНаименованию(НомерГТД, Истина,, Номенклатура);
	
	Если ЗначениеЗаполнено(Серия) тогда
		Возврат Серия;
	КонецЕсли;
	
	СерияНоменклатуры = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	СерияНоменклатуры.Владелец = Номенклатура;
	СерияНоменклатуры.Наименование = НомерГТД;
	СерияНоменклатуры.СтранаПроисхождения = Страна;
	СерияНоменклатуры.Комментарий = "Создан при передаче данных из УТ 11 " + ТекущаяДата();
	
	Если ЗначениеЗаполнено(НомерГТДСсылка) Тогда
		СерияНоменклатуры.НомерГТД = НомерГТДСсылка;
	Иначе

		Номер = Справочники.НомераГТД.НайтиПоКоду(НомерГТД);
		
		Если Не ЗначениеЗаполнено(Номер) тогда
			
			НомерГТДОбъект = Справочники.НомераГТД.СоздатьЭлемент();
			НомерГТДОбъект.Код = НомерГТД;
			НомерГТДОбъект.Комментарий = "Создан при передаче данных из УТ 11 " + ТекущаяДата();
			НомерГТДОбъект.Записать();
			СерияНоменклатуры.НомерГТД = НомерГТДОбъект.Ссылка;
			
		Иначе
			СерияНоменклатуры.НомерГТД = Номер;
		КонецЕсли;

	КонецЕсли;
	
	СерияНоменклатуры.Записать();
	Возврат СерияНоменклатуры.Ссылка;

КонецФункции

Функция ДанныеВJSONХранилище(Данные) 	
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9)); 	
	
	Возврат ДанныеВозврат;  	

КонецФункции

Функция ХранилищеJSONВСтруктуру(Данные)
	
	ДанныеТекст = Данные.Получить();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеТекст);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции

Функция ИзменитьСтатусАктаОРасхождении(ГУИДДокументаАкт, ГУИДДокумента, Статус, СтатусАкта, ТабличнаяЧасть, Комментарий)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис: Запуск. ИзменитьСтатусАктаОРасхождении");
	
	ТекстОшибки = "";	
	АктСсылка = Документы.АктОРасхожденияхПослеПриемки.ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(ГУИДДокументаАкт)));     
	
	Если АктСсылка.Пустая() ИЛИ АктСсылка.ПолучитьОбъект() = Неопределено Тогда        
		
		ТекстОшибки = "В УТ10 не найден документ Акт о расхождении после приёмки по уникальному идентификатору ='" + ГУИДДокументаАкт + "'";
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, 
		"Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат РезультатВыполнения;

	КонецЕсли;          
	
	ПТУСсылка = Документы.ПоступлениеТоваровУслуг.НайтиПоРеквизиту("ИДДокументаВСмежнойБазе", ГУИДДокумента);
	
	Если ПТУСсылка.Пустая() ИЛИ ПТУСсылка.ПолучитьОбъект() = Неопределено  Тогда
		
		ТекстОшибки = "В УТ10 не найден документ ПТУ по реквизиту ИД документа в смежной базе='" + ГУИДДокумента + "'";
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, 
		"Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
		Возврат РезультатВыполнения;

	КонецЕсли;  
	
	Если ВРЕГ(Статус) = "КОРРЕКТИРОВКАОСТАТКАВУТ10" Тогда    
		
		//+Макрушин Е. 05.02.2026 #UT10-5654
		РеквизитыАкта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АктСсылка, "ТранзитнаяПоставка, Статус");
		ТекущийСтатусАкта = РеквизитыАкта.Статус;
		
		Если НЕ РеквизитыАкта.ТранзитнаяПоставка Тогда
			
			Если ТекущийСтатусАкта = Перечисления.СтатусыАктаОРасхождениях.НеСогласовано
				ИЛИ ТекущийСтатусАкта = Перечисления.СтатусыАктаОРасхождениях.ОтработаноВУТ11
				ИЛИ ТекущийСтатусАкта = Перечисления.СтатусыАктаОРасхождениях.Отработано Тогда
				
				ТекстОшибки = "Ошибка при изменении статуса документа "+Строка(АктСсылка) + ", т.к. он уже имеет статус " + ТекущийСтатусАкта;
					РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
					ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
					+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
					Возврат РезультатВыполнения;
				
			КонецЕсли;
			
			Если ВРЕГ(СтатусАкта) = "ОТРАБАТЫВАЕТСЯ" Тогда
				
				//если Отрабытывается, то меняем в акте только статус, остальное не трогаем
				АктОбъект = АктСсылка.ПолучитьОбъект(); 
				АктОбъект.Статус = Перечисления.СтатусыАктаОРасхождениях.Отрабатывается;    
				
				Попытка
					АктОбъект.Записать(?(АктОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
				Исключение
					
					ТекстОшибки = "Ошибка при изменении статуса документа "+Строка(АктСсылка);
					РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
					ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
					+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
					Возврат РезультатВыполнения;
					
				КонецПопытки;
				
			ИначеЕсли ВРЕГ(СтатусАкта) = "ОТРАБОТАНО" ИЛИ  ВРЕГ(СтатусАкта) = "НЕСОГЛАСОВАНО" Тогда
				
				АктОбъект = АктСсылка.ПолучитьОбъект();
				ИсходнаяТЧ = АктОбъект.Товары.Выгрузить();
				НоваяТЧ = ИсходнаяТЧ.СкопироватьКолонки();
				
				ТЧТовары = ХранилищеJSONВСтруктуру(ТабличнаяЧасть);   
				
				Если ТЧТовары.Количество() = 0 Тогда
					
					ТекстОшибки = "Из УТ передана пустая табличная часть";
					РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
					ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
					+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
					Возврат РезультатВыполнения;

				КонецЕсли; 
					
				Для Каждого Строка Из ТЧТовары Цикл     
					
					Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Строка.Номенклатура);
					Строка.Номенклатура = Номенклатура;
					
					Если Номенклатура.Пустая() Тогда                            
						
						ТекстОшибки = ТекстОшибки+?(СокрЛП(ТекстОшибки) = "", "", " ; ") + "Не найдена номенклатура с кодои МДМ " + СокрЛП(Строка.Номенклатура);
						Продолжить;        
						
					КонецЕсли;				
					
					СтруктураПоискаНоменклатуры = Новый Структура("Номенклатура", Номенклатура);
					
					//Если Строка.Цена <> 0 Тогда
					//	СтруктураПоискаНоменклатуры.Вставить("Цена", Строка.Цена);
					//КонецЕсли;
					
					МассивСтрокВДокументе = ИсходнаяТЧ.НайтиСтроки(СтруктураПоискаНоменклатуры);
					
					Если МассивСтрокВДокументе.Количество() = 0 Тогда    
						
						ТекстОшибки = ТекстОшибки+?(СокрЛП(ТекстОшибки) = "", "", Символы.ПС) + "Не найдена строка с номенклатурой " + Номенклатура; 
							//+ ?(ЗначениеЗаполнено(Строка.Цена), " и ценой " + Строка.Цена, "");
						Продолжить;        
						
					КонецЕсли;  
					
					// сначала сопоставляем по номенклатуре + по количеству, 
					СтруктураПоискаНоменклатуры.Вставить("Количество", Строка.Количество);
					СтруктураПоискаНоменклатуры.Вставить("КоличествоПоДокументу", Строка.КоличествоПоДокументу);
					
					МассивСтрокВДокументе = ИсходнаяТЧ.НайтиСтроки(СтруктураПоискаНоменклатуры);
					
					Для Каждого СтрокаВДокументе Из МассивСтрокВДокументе Цикл
						
						// совпало количество,оставляем старую строку
						// основная масса ситуаций закрывается этим кодом
						НовСтрокаТЧ = НоваяТЧ.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, СтрокаВДокументе);
						
						Если ЗначениеЗаполнено(Строка.Действие) Тогда 
							НовСтрокаТЧ.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки[Строка.Действие];
						Иначе
							НовСтрокаТЧ.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ПустаяСсылка();
						КонецЕсли;
						
						НовСтрокаТЧ.КомментарийПоставщика = Строка.КомментарийПоставщика;
						НовСтрокаТЧ.КоличествоРасхождения = НовСтрокаТЧ.Количество - НовСтрокаТЧ.КоличествоПоДокументу;
						
						ИсходнаяТЧ.Удалить(СтрокаВДокументе);
						
						Строка.КоличествоПоДокументу = 0;
						Строка.Количество = 0;
						
						Прервать;
						
					КонецЦикла;
					
				КонецЦикла;
					
		        // поиск теперь без учета количества, только по номенклатуре и цене
				Для Каждого Строка Из ТЧТовары Цикл
					
					Если (Строка.Количество = 0 И Строка.КоличествоПоДокументу = 0) 
						ИЛИ Номенклатура.Пустая() Тогда
						Продолжить;
					КонецЕсли;
					
					Номенклатура = Строка.Номенклатура;
					СтруктураПоискаНоменклатуры = Новый Структура("Номенклатура", Номенклатура);
					
					//Если Строка.Цена <> 0 Тогда
					//	СтруктураПоискаНоменклатуры.Вставить("Цена", Строка.Цена);
					//КонецЕсли;
					
					МассивСтрокВДокументе = ИсходнаяТЧ.НайтиСтроки(СтруктураПоискаНоменклатуры);
					
					Для Каждого СтрокаВДокументе Из МассивСтрокВДокументе Цикл
						
						//+Шульман А. 06.03.2026 #UT10-5750
						//КоличествоДляЗачета = Мин(Строка.Количество, СтрокаВДокументе.КоличествоПоДокументу);      
						КоличествоДляЗачета = Мин(Строка.Количество, СтрокаВДокументе.Количество); 
						//-Шульман А. 06.03.2026 #UT10-5750
						КоличествоДляЗачетаПоДокументу = Мин(Строка.КоличествоПоДокументу, СтрокаВДокументе.КоличествоПоДокументу);
							
						Если КоличествоДляЗачета = 0 И КоличествоДляЗачетаПоДокументу = 0 Тогда
							Продолжить;
						КонецЕсли;
						
						НовСтрокаТЧ = НоваяТЧ.Добавить();
						ЗаполнитьЗначенияСвойств(НовСтрокаТЧ, СтрокаВДокументе);
						
						//+Шульман А. 06.03.2026 #UT10-5750     
						НовСтрокаТЧ.Количество = КоличествоДляЗачета; 
						НовСтрокаТЧ.КоличествоПоДокументу = КоличествоДляЗачетаПоДокументу;    
						НовСтрокаТЧ.КоличествоРасхождения = КоличествоДляЗачета - КоличествоДляЗачетаПоДокументу;  
						
						Если НовСтрокаТЧ.КоличествоРасхождения = 0 Тогда
							НовСтрокаТЧ.РасхожденияКМ = Ложь;
						КонецЕсли;
						//-Шульман А. 06.03.2026 #UT10-5750
						
						Если ЗначениеЗаполнено(Строка.Действие)
							//+Шульман А. 06.03.2026 #UT10-5750
							И Не НовСтрокаТЧ.КоличествоРасхождения = 0 Тогда   
							//-Шульман А. 06.03.2026 #UT10-5750
							НовСтрокаТЧ.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки[Строка.Действие];
						Иначе
							НовСтрокаТЧ.Действие = Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки.ПустаяСсылка();
						КонецЕсли;  
						
						
						НовСтрокаТЧ.КомментарийПоставщика = Строка.КомментарийПоставщика;
						
						Строка.Количество = Строка.Количество - КоличествоДляЗачета;
						Строка.КоличествоПоДокументу = Строка.КоличествоПоДокументу - КоличествоДляЗачетаПоДокументу;
						
						СтрокаВДокументе.Количество = СтрокаВДокументе.Количество - КоличествоДляЗачета;
						СтрокаВДокументе.КоличествоПоДокументу = СтрокаВДокументе.КоличествоПоДокументу - КоличествоДляЗачетаПоДокументу;
						
						Если СтрокаВДокументе.Количество = 0 И СтрокаВДокументе.КоличествоПоДокументу = 0 Тогда
							ИсходнаяТЧ.Удалить(СтрокаВДокументе);
						КонецЕсли;
						
					КонецЦикла;
						
				КонецЦикла;        
				
				Для Каждого СтрокаТЧ Из ИсходнаяТЧ Цикл
					
					Если СтрокаТЧ.Количество <> 0 ИЛИ СтрокаТЧ.КоличествоПоДокументу <> 0 Тогда
						
						ТекстОшибки = ТекстОшибки + ?(СокрЛП(ТекстОшибки) = "", "", " ; ") + "Не сопоставлено из акта УТ10: номенклатура " 
							+ СокрЛП(Строка.Номенклатура) + ", количество по док.=" + СтрокаТЧ.КоличествоПоДокументу
							+ ", количество факт.=" + СтрокаТЧ.Количество + Символы.ПС; 
						
					КонецЕсли;
					
				КонецЦикла;
				
				Для Каждого СтрокаТЧ Из ТЧТовары Цикл
					
					Если СтрокаТЧ.Количество <> 0 ИЛИ СтрокаТЧ.КоличествоПоДокументу <> 0 Тогда
						
						ТекстОшибки = ТекстОшибки + ?(СокрЛП(ТекстОшибки) = "", "", " ; ") + "Не сопоставлено из акта УТ10: номенклатура " 
							+ СокрЛП(Строка.Номенклатура) + ", количество по док.=" + СтрокаТЧ.КоличествоПоДокументу
							+ ", количество факт.=" + СтрокаТЧ.Количество + Символы.ПС; 
						
					КонецЕсли;
					
				КонецЦикла;
				
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда  
					
					РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
					ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
					+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));  
					
					Возврат РезультатВыполнения;

				КонецЕсли;				
				
				АктОбъект.Товары.Загрузить(НоваяТЧ);
				
				// пересчет сумм по итоговому
				Для Каждого СтрокаНоваяТЧ Из АктОбъект.Товары Цикл
					
					ОбработкаТабличныхЧастей.РассчитатьКоличествоМестТабЧасти(СтрокаНоваяТЧ, АктОбъект);
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаНоваяТЧ, АктОбъект);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаНоваяТЧ, АктОбъект);
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуРасхожденияТабЧасти(СтрокаНоваяТЧ, АктОбъект);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСРасхожденияТабЧасти(СтрокаНоваяТЧ, АктОбъект);
					
				КонецЦикла;				
				
				АктОбъект.ЗаполнитьРасхожденияКМ(АктОбъект. ДокументОснование, Ложь, Истина);
				
				Если ВРЕГ(СтатусАкта) = "НЕСОГЛАСОВАНО" Тогда
					АктОбъект.Статус = Перечисления.СтатусыАктаОРасхождениях.НеСогласовано;
				Иначе
					АктОбъект.Статус = Перечисления.СтатусыАктаОРасхождениях.ОтработаноВУТ11;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Комментарий) И Найти(АктОбъект.Комментарий, " Из УТ 11 - " + СокрЛП(Комментарий)) = 0 Тогда 
					АктОбъект.Комментарий = СокрЛП(АктОбъект.Комментарий) + " Из УТ 11 - " + СокрЛП(Комментарий);
				КонецЕсли;               
				
				Попытка
					АктОбъект.Записать(?(АктОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
				Исключение
					
					ТекстОшибки = "Ошибка при изменении статуса документа "+Строка(АктСсылка);
					РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
					ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
					+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
					Возврат РезультатВыполнения;
					
				КонецПопытки;
				
			КонецЕсли;	
			
		//Если (ВРЕГ(СтатусАкта) = "ОТРАБОТАНО" ИЛИ  ВРЕГ(СтатусАкта) = "НАКОНТРОЛЕ") Тогда
		ИначеЕсли (ВРЕГ(СтатусАкта) = "ОТРАБОТАНО" ИЛИ  ВРЕГ(СтатусАкта) = "НАКОНТРОЛЕ") Тогда
		//-Макрушин Е. 05.02.2026 #UT10-5654
		
			ПромТабличнаяЧасть = АктСсылка.Товары.Выгрузить();
			ТЧТовары = ХранилищеJSONВСтруктуру(ТабличнаяЧасть);   
			
			Если ТЧТовары.Количество() > 0 Тогда     
				
				Для Каждого Строка Из ТЧТовары Цикл     
					
					ПромНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("КодМДМ", Строка.Номенклатура); 
					
					Если ПромНоменклатура.Пустая() Тогда                            
						
						ТекстОшибки = ТекстОшибки+?(СокрЛП(ТекстОшибки) = "", "", " ; ") + "Не найдена номенклатура с кодои МДМ " + СокрЛП(Строка.Номенклатура) 
						+ " в переданной строке с кодом " + СокрЛП(Строка.КодСтрокиУТ11) + "";
						Продолжить;        
						
					КонецЕсли;				
					
					МассивСтрокВДокументе = ПромТабличнаяЧасть.НайтиСтроки(Новый Структура("КлючСтроки,Номенклатура,Брак", Строка.КодСтрокиУТ11, ПромНоменклатура, Строка.Брак));
					
					Если МассивСтрокВДокументе.Количество()<> 1 Тогда    
						
						ТекстОшибки = ТекстОшибки+?(СокрЛП(ТекстОшибки) = "", "", Символы.ПС) + "Не найдена строка с параметрами : Код строки "
						+ СокрЛП(Строка.КодСтрокиУТ11) + " , код МДМ номенклатуры " + СокрЛП(Строка.Номенклатура) + " , брак " + Формат(Строка.Брак, "БЛ=Ложь; БИ=Истина") + "";
						Продолжить;        
						
					КонецЕсли;  
					
					Попытка
						
						ЕстьСтрокаВДокументе					   = МассивСтрокВДокументе[0];
						
						Если ЗначениеЗаполнено(Строка.Действие) Тогда
							ЕстьСтрокаВДокументе.Действие 			= Перечисления.ВариантыДействийПоРасхождениямВАктеПослеПриемки[СокрЛП(Строка.Действие)];
						КонецЕсли;
						
						ЕстьСтрокаВДокументе.Пересорт 			   	 = Строка.Пересорт;
						ЕстьСтрокаВДокументе.Брак     			   	 = Строка.Брак;
						ЕстьСтрокаВДокументе.КомментарийМенеджера  	 = СокрЛП(Строка.КомментарийМенеджера);
						ЕстьСтрокаВДокументе.КомментарийПоставщика 	 = СокрЛП(Строка.КомментарийПоставщика);
						ЕстьСтрокаВДокументе.НомерПТУ			   	 = СокрЛП(Строка.НомерПТУ);
						ЕстьСтрокаВДокументе.ДатаПТУ			   	 = Дата(Строка.ДатаПТУ);
						ЕстьСтрокаВДокументе.СкладОтгрузкиПоставщику = СокрЛП(Строка.СкладОтгрузкиПоставщику);  

						Если НЕ ЗначениеЗаполнено(ЕстьСтрокаВДокументе.СерияНоменклатуры) Тогда 
							
							Если ЗначениеЗаполнено(Строка.НомерГТД) Тогда
								ПромНомерГТД = СокрЛП(Строка.НомерГТД);							
							Иначе
								ПромНомерГТД = "--";
							КонецЕсли;  
							
							НомерГТДСсылка = Справочники.НомераГТД.НайтиПоКоду(ПромНомерГТД);
							Страна = Справочники.КлассификаторСтранМира.ПустаяСсылка();
							ЕстьСтрокаВДокументе.СерияНоменклатуры = СоздатьСерию(ПромНоменклатура, ПромНомерГТД, Страна, НомерГТДСсылка);		
							
						КонецЕсли;

					Исключение
						
						ТекстОшибки = ТекстОшибки+?(СокрЛП(ТекстОшибки) = "","",Символы.ПС) + "Ошибка заполнения строки с параметрами : Код строки - "
						+ СокрЛП(Строка.КодСтрокиУТ11) + " , номенклатура - " + СокрЛП(ПромНоменклатура) + " , брак - " + Формат(Строка.Брак, "БЛ=Ложь; БИ=Истина") 
						+ " " + СокрЛП(ОписаниеОшибки());
						Продолжить;
						
					КонецПопытки;
					
				КонецЦикла;        
				
				Если ЗначениеЗаполнено(ТекстОшибки) Тогда  
					
					РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
					ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
					ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
					+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));  
					
					Возврат РезультатВыполнения;

				КонецЕсли;				
			Иначе
				
				ТекстОшибки = "Из УТ10 передана пустая табличная часть";
				РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
				ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
				+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
				Возврат РезультатВыполнения;

			КонецЕсли;   
			
			АктОбъект = АктСсылка.ПолучитьОбъект(); 
			АктОбъект.Товары.Загрузить(ПромТабличнаяЧасть);
			АктОбъект.Статус = Перечисления.СтатусыАктаОРасхождениях.ОтработаноВУТ11;    
			
			Если ЗначениеЗаполнено(Комментарий) И Найти(АктОбъект.Комментарий, " Из УТ 11 - " + СокрЛП(Комментарий)) = 0 Тогда 
				АктОбъект.Комментарий = СокрЛП(АктОбъект.Комментарий) + " Из УТ 11 - " + СокрЛП(Комментарий);
			КонецЕсли;               
			
			Попытка
				АктОбъект.Записать(?(АктОбъект.Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
			Исключение
				
				ТекстОшибки = "Ошибка при изменении статуса документа "+Строка(АктСсылка);
				РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
				ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
				+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
				Возврат РезультатВыполнения;
				
			КонецПопытки;                  
			
			ПТУОбъект = ПТУСсылка.ПолучитьОбъект(); 
			ПТУОбъект.Статус = Перечисления.СтатусыПТУ.КороректировкаОстаткаВУТ10;   
			
			Попытка
				ПТУОбъект.Записать(?(ПТУОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			Исключение
				
				ТекстОшибки = "Ошибка при изменении статуса документа "+Строка(ПТУСсылка);
				РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
				ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
				ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
				+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
				Возврат РезультатВыполнения;

			КонецПопытки;  			
			
		Иначе
			
			ТекстОшибки = "Передан некорректный статус для документа Акт о расхождении "+Строка(ГУИДДокументаАкт)+ " статус " + СокрЛП(СтатусАкта);
			РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
			ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
			ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
			+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
			Возврат РезультатВыполнения;
			
		КонецЕсли;	  
		
	Иначе
		
		ТекстОшибки = "Передан некорректный статус для документа ПТУ "+Строка(ГУИДДокумента)+ " статус " + СокрЛП(Статус);
		РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));
		ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
		+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		Возврат РезультатВыполнения;

	КонецЕсли;	
	
	РезультатВыполнения = ДанныеВJSONХранилище(СформироватьСтруктуруОтвета(ТекстОшибки));	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис UpdateVarianceAct", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. ИзменитьСтатусАктаОРасхождении " 
	+ Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));   
	
	Возврат РезультатВыполнения;  
	
КонецФункции

Функция СформироватьСтруктуруОтвета(ТекстОшибки = "") 
	
	Ответ = Новый Структура("Результат,ТекстОшибки");
	Ответ.Результат = ?(ЗначениеЗаполнено(ТекстОшибки), Ложь, Истина);
	Ответ.ТекстОшибки = ТекстОшибки;  
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ЗаписьЖурналаРегистрации("Транзитные поставки.Ошибка", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка изменения статуса UpdateVarianceAct " + СокрЛП(ТекстОшибки));
	КонецЕсли; 	     
	
	Возврат Ответ; 	 
	
КонецФункции
